{'IR': 'Inspired', 'bucket': '+', 'guidewords': ['righteous', 'pre-ordained', 'beautiful'], 'likes': 'I am most deeply moved by things that feel righteous—by which I mean aligned with a kind of moral clarity or sense of higher truth. I find comfort in believing that some things are not arbitrary, but pre-ordained, as though they were always meant to be. Whether it’s a decision that feels intuitively right, a moment that clicks into place, or a piece of beauty that transcends explanation, I am drawn to what carries that aura of purpose. I seek beauty that is more than surface-deep—beauty that suggests meaning, harmony, and inner coherence. When I sense that something wasn’t just made but was called into being, it feels sacred to me. I’m not interested in randomness or spectacle for its own sake; I’m interested in what resonates, what affirms that the world is not just noise but can be meaningful. I like when things feel part of a larger story, when they carry the weight of intention, of belief, of truth. It’s not about perfection, exactly, but about integrity—about being guided by something beyond convenience or trend. I’m drawn to experiences and expressions that feel like they are in tune with something bigger than any one person, as if they were waiting to be found.'}
{'IR': 'Inspired', 'bucket': '-', 'guidewords': ['false', 'uncreative', 'dull'], 'dislikes': 'I have a visceral reaction to anything that strikes me as false. It’s not just about lying—it’s about hollowness, about pretending to be something without the substance to back it up. I find it hard to tolerate environments where appearances matter more than convictions, where things are performed instead of lived. There’s a deep frustration I feel when I’m faced with the uncreative—with things that are derivative, mechanical, or soulless. It’s not about rejecting structure or repetition entirely, but when something feels like it was made without vision or inner drive, it just drains me. Dullness, to me, isn’t just boring—it’s disheartening. It suggests a kind of giving up, a failure to seek meaning or beauty. I notice it in conversations that go nowhere, in systems that operate without questioning their own logic, in choices that seem made to avoid discomfort rather than pursue truth. When I sense that something exists just to fill space, or just to be safe, I recoil from it. I need to feel that what I’m encountering matters to someone, that it came from a place of conviction or imagination. Without that, it feels like the world is asleep—like we’re pretending things have meaning when we’ve actually stopped asking the deeper questions. I don’t just dislike that. I resist it.'}
{'IR': 'Popular', 'bucket': '+', 'guidewords': ['preferred', 'popular', 'favorite'], 'likes': 'I take comfort in knowing what’s preferred by others. Popularity, to me, isn’t just about trend-following—it’s a signal that something resonates widely, that it holds social value and recognition. I like being connected to what people are talking about, gravitating toward what has earned status as a favorite—not just mine, but ours. There’s a kind of safety and affirmation in knowing I’m aligned with what most people enjoy or agree upon. Whether it’s ideas, styles, or ways of doing things, I find satisfaction in choosing what is already preferred because it suggests validation, coherence, and shared understanding. Popular things carry the weight of collective attention; they reflect our common priorities, our consensus about what’s worth celebrating. I don’t mind when things are mainstream—I actually prefer it, because it means I’m not alone. There’s a joy in being part of something bigger, in joining in on what’s already beloved by many. I’m drawn to favorites for that very reason: they’ve stood out, risen to the top, been chosen again and again. It tells me they’re doing something right. I don’t see it as conformity—I see it as connection, as orientation toward what brings people together. When something is widely embraced, I feel it’s worth my attention too. I like the clarity that comes from knowing what the crowd has already decided is good. It helps me trust my instincts, and it keeps me grounded in something shared and meaningful.'}
{'IR': 'Popular', 'bucket': '-', 'guidewords': ['resented', 'feared', 'isolated'], 'dislikes': 'What unsettles me most is when something or someone is widely resented, feared, or isolated. Those feelings imply exclusion, disconnection, or even social threat—and I instinctively move away from them. I don’t like being in spaces where there’s tension or where people are being pushed to the margins. When something evokes fear or resentment, it often means it’s out of step with what people value or trust, and I find that dissonance hard to be around. I feel uneasy in situations where there’s too much unfamiliarity or where the energy is confrontational. Isolation, in particular, bothers me—not just for myself, but even watching others experience it. It signals a breakdown in the social fabric, a failure to connect or belong. I don’t enjoy being the outlier, the lone voice, or the one going against the grain. It doesn’t feel brave—it feels disconnected. I prefer when things are recognizable, accepted, and celebrated rather than alienating or divisive. That’s not to say I can’t handle difference, but when the mood turns cold or hostile, when people pull away instead of drawing together, I find it deeply uncomfortable. I avoid things that stir up resentment or fear because they threaten the sense of harmony and community I value. I want to feel part of something that brings people closer—not something that risks isolation or sparks division. For me, being in tune with what others embrace isn’t just a preference—it’s how I feel safe and socially anchored.'}
{'IR': 'Moral', 'bucket': '+', 'guidewords': ['solidary', 'responsible', 'just'], 'likes': 'I’m most at ease when I feel like people are looking out for each other—when responsibility, justice, and solidarity aren’t just ideals, but habits. I believe in acting with care, not only for myself but for those around me. There’s something deeply reassuring about being in a space where people consider the consequences of their actions on others, where fairness isn’t up for debate but is simply expected. I admire those who step up, who take responsibility even when it’s inconvenient, and who show up for others in quiet, consistent ways. I’m drawn to systems and relationships that are grounded in mutual care—where no one is left behind, and everyone understands that their choices affect a larger whole. I value conversations that grapple with fairness and shared obligation, that ask, “What’s right?” rather than “What’s easy?” There’s a deep moral satisfaction for me in seeing people behave justly—not for reward or recognition, but because they believe it matters. I don’t need perfection, but I do look for sincerity in how people treat others and how they carry themselves. To me, responsibility isn’t a burden—it’s a form of respect. And when I see solidarity in action, when I witness communities organizing themselves around justice and care, it gives me hope. That’s the kind of world I want to be a part of: one where people understand that our well-being is bound up in each other.'}
{'IR': 'Moral', 'bucket': '-', 'guidewords': ['inhumane', 'asocial', 'egoistic'], 'dislikes': 'What I struggle with most is witnessing inhumane, asocial, or egoistic behavior—acts that feel detached from any concern for others. When people act purely out of self-interest, without considering the cost to those around them, it hits a nerve in me. It’s not just disappointment—it feels like something has been violated. I can’t understand how anyone could look away from suffering, or justify choices that isolate and harm others for personal gain. I feel alienated in spaces where individualism is celebrated without question, where success is measured by how far one can get ahead rather than how well we treat each other along the way. Asocial behavior, in particular, feels like a rupture in the very thing that makes us human—our capacity to care, to relate, to belong. When people prioritize their own comfort over someone else’s dignity, I feel a deep sense of unease. It’s not about judging people for having needs or goals—it’s about the refusal to see that those needs and goals exist in a shared world. Inhumane systems or logic—where people are reduced to numbers or dismissed as problems—frustrate me to no end. They feel like a betrayal of our collective responsibility. When I see egoism rewarded or normalized, I feel the need to push back, to reassert that our lives are interconnected and that justice must be more than a slogan. I simply can’t accept a worldview where looking out for yourself is enough. That’s not how I want to live, and it’s not the kind of society I want to help build.'}
{'IR': 'Civic', 'bucket': '+', 'guidewords': ['legal', 'agreed', 'common'], 'likes': 'I’ve always found a sense of reassurance in what is legal, agreed upon, and common. To me, these aren’t just bureaucratic markers—they reflect the collective will, the shared structure that holds society together. I appreciate systems where rules are clear, expectations are known, and everyone plays by the same standards. I take comfort in processes that have been negotiated openly and that apply to everyone equally. When something is agreed upon, I see it as the product of discussion, compromise, and civic trust—not just authority for its own sake, but the kind of agreement that makes coexistence possible. I value routines, protocols, and conventions—not because I’m rigid, but because they signal mutual respect and provide a framework for fairness. When people follow norms or laws, it feels like an expression of shared belonging—like we’re all participating in a social contract we’ve chosen together. Even everyday acts that show respect for public space, community guidelines, or group decisions mean a lot to me. They reflect an acknowledgment that none of us lives in isolation. I believe in the importance of rules not just as constraints, but as a foundation for collaboration and civic trust. It’s not about blind obedience—it’s about honoring the structures that keep things from falling apart.'}
{'IR': 'Civic', 'bucket': '-', 'guidewords': ['scandalous', 'unacceptable', 'inappropriate'], 'dislikes': 'What makes me most uncomfortable is when people act in ways that are scandalous, unacceptable, or inappropriate—especially when they ignore the basic norms that keep social life functioning. I’m not quick to judge, but when someone flagrantly disregards shared agreements or social expectations, it unsettles me. It feels like a breakdown in the mutual understanding we rely on to live together. Scandal, in my eyes, isn’t just about moral panic; it’s about a violation of trust—a rupture in the implicit contract we have with one another. I have a hard time with behaviors that ignore context or dismiss the norms that help others feel safe and respected. Unacceptable actions, especially those that seem self-serving or provocative for attention’s sake, don’t just seem rude—they seem destabilizing. I get frustrated when people treat community rules or public standards as optional, as if their own preferences matter more than the group’s cohesion. Inappropriate conduct, especially when it’s willfully defiant or inconsiderate, feels like a disregard for the invisible fabric that holds us together. I know that rules aren’t always perfect, but I still believe in the value of having them—and in the social responsibility to uphold them. When someone undermines that, even subtly, I can’t help but feel that something essential is being put at risk.'}
{'IR': 'Economic', 'bucket': '+', 'guidewords': ['beneficial', 'economic', 'affordable'], 'likes': 'I’m most drawn to things that are clearly beneficial—not just in theory, but in tangible, practical ways. I value what works economically, what delivers a clear return, and what can be sustained without waste. I find satisfaction in choices that are affordable and well-justified, the kind that make sense when you look at the bigger picture of resources, effort, and outcome. Efficiency and cost-effectiveness aren’t just preferences; they’re principles that guide how I see the world. When I evaluate a situation, I instinctively consider its impact and whether it offers good value—not just in monetary terms, but in the smart use of time, energy, and materials. I admire systems that balance output with input, where everything serves a purpose and resources are allocated thoughtfully. Whether it’s a decision, a product, or a process, I like when things are lean, optimized, and ultimately sustainable. To me, affordability is not about being cheap—it’s about being intentional and responsible. A well-balanced approach to cost reflects a respect for what’s available and a vision for what’s possible. I gravitate toward solutions that offer stability and utility, especially when they’re repeatable and scalable. It’s in this clarity—this alignment between means and ends—that I find comfort and confidence.'}
{'IR': 'Economic', 'bucket': '-', 'guidewords': ['wasted', 'costly', 'unproductive'], 'dislikes': 'What I can’t tolerate is waste. It bothers me deeply when something is costly without justification, or when effort is poured into something that turns out to be unproductive. Inefficiency, especially when it’s avoidable, feels like a kind of negligence. I get frustrated when I see systems bogged down by unnecessary steps, resources funneled into things that don’t generate value, or time being used without clear intent. It’s not just a matter of personal annoyance; it strikes me as socially irresponsible. Every decision has a cost, and when those costs are ignored or downplayed, it feels like we’re pretending the consequences don’t exist. I dislike indulgence for its own sake, or practices that drain resources without building toward something meaningful. Even well-intentioned actions lose credibility in my eyes if they’re not designed with outcomes in mind. I’m skeptical of vague promises and unimpressed by showy projects that lack follow-through or sustainability. What’s worse is when this kind of waste is normalized, framed as acceptable simply because it’s always been done that way. That kind of thinking frustrates me more than the waste itself. I need to see purpose in action—an economy of intention. When I don’t, I see failure not just of strategy, but of principle.'}
{'IR': 'Functional', 'bucket': '+', 'guidewords': ['effective', 'necessary', 'quick'], 'likes': 'I find the most value in things that are effective, necessary, and quick—those that serve a clear purpose and get the job done without unnecessary complication. I appreciate when something works as intended, smoothly and reliably, especially when the process behind it is streamlined and logical. I like tools, systems, and decisions that cut through clutter and produce results. Functionality, to me, isn’t just about utility; it’s about clarity and momentum. When something is necessary, I want it to be designed with intention—nothing extra, nothing missing. I respect solutions that anticipate problems and solve them efficiently, without overengineering or wasting time. I admire workflows that are tight, communications that are direct, and setups that respect people's time and attention. There’s a satisfaction in seeing something operate with precision, and I gravitate toward environments that value practicality over posturing. I enjoy seeing plans that are grounded in real needs and executed with discipline. I’m not interested in flourish or ceremony for its own sake—I care about outcomes. If something is quick and effective, that signals respect not just for efficiency but for the end goal itself. It means we're moving, we're solving, and we’re not making things harder than they need to be.'}
{'IR': 'Functional', 'bucket': '-', 'guidewords': ['dysfunctional', 'inefficient', 'useless'], 'dislikes': 'What frustrates me most is dysfunction—when things don’t work, and worse, when no one seems bothered by it. I lose patience with inefficient systems or processes that drag on without delivering results. Whether it's a tool that overpromises and underdelivers, a meeting that runs in circles, or a design that's all form and no function, I find myself immediately questioning why it exists in the first place. Uselessness, to me, isn't just about lacking value—it's about wasting opportunity. I struggle with environments where problems are tolerated instead of fixed, where complexity is added instead of removed, and where there's no urgency to make things better. I don’t understand the tolerance for inefficiency or the glorification of process over outcome. When I see something that could be simplified but isn’t, it signals a deeper lack of care or attention to what matters. I get especially frustrated when dysfunction becomes normalized—when people stop noticing how broken something is just because it’s familiar. That kind of stagnation is hard for me to accept. I need to feel that effort is going toward something that works, that delivers, that improves things in concrete ways. If it’s not helping or moving us forward, I question why we’re doing it at all.'}
{'IR': 'Ecological', 'bucket': '+', 'guidewords': ['sustainable', 'natural'], 'likes': 'I find deep comfort in what is sustainable and natural. These aren’t just aesthetic preferences—they reflect how I believe things ought to be. I’m drawn to systems, choices, and ways of living that work in harmony with their surroundings and that can continue without depleting what they rely on. There’s something profoundly grounding about balance—about rhythms that repeat, ecosystems that self-correct, and materials or practices that leave room for regeneration. When I see something that fits naturally into its environment—something that doesn’t overreach or strain the world around it—I feel a kind of ease. I admire choices that are mindful, measured, and respectful of limits. I believe value comes not from excess but from restraint, from the ability to meet needs without causing harm. Naturalness, to me, suggests integrity—it means that something hasn’t been warped to meet artificial standards, but has been allowed to follow its own form and function. I’m most inspired by designs or ideas that look to nature for guidance, that embrace cycles rather than try to dominate them. Sustainability isn’t just a goal—it’s a mindset. It asks: How do we live in a way that others can also live? That question shapes how I make decisions, how I judge progress, and how I understand responsibility.'}
{'IR': 'Ecological', 'bucket': '-', 'guidewords': ['unnatural', 'irreversible'], 'dislikes': 'What I struggle with most are things that feel unnatural or irreversible. When I see decisions that sever us from the systems we depend on—actions that disrupt without regard for recovery—I feel a visceral discomfort. Irreversibility scares me, because it suggests a kind of arrogance: the idea that we can act without consequences, that we can bend things past their breaking point and still expect stability. I dislike solutions that rely on control rather than cooperation, that impose order instead of listening to existing patterns. When something is overly synthetic, detached from its context, or engineered to override natural limits, I question its wisdom. I worry about choices that close doors—that leave damage we can’t undo or create dependencies we can't sustain. There’s a kind of violence in pushing too hard against ecological balance, in refusing to see ourselves as part of a larger system. I get uneasy in environments that are stripped of context or over-optimized for short-term gain. Unnatural isn’t always about technology or change—it’s about ignoring relationship, feedback, and the subtle signals that guide resilience. I need to believe that what we do today won’t ruin tomorrow. When I don’t see that care, I see recklessness, and I want no part in it.'}
